{"pages":[],"posts":[{"title":"面试中项目经历回答思路","text":"说得到不代表做得到（咸鱼握拳.jpg） 上个月面 iMUR，从业务面到总监面的大部分时间都在聊包括暑假实习在内的项目经历。“极其看重对一段研究经历的完整介绍”，暂且不论面试官如何追问，“有的放矢缓缓道来”是我觉得比较好的陈述状态，但遗憾在两次面试都没有做到至少先让自己满意的程度（拍大腿.jpg） 归根结底还是平时的反思+回顾太少了惹！语言表达能力欠缺+临场发挥不好只是表象辣。 接下来分【平时-项目中】、【面试前】及【面试中】三个阶段阐述。 平时-项目中 信息：尽力获取 Full Picture+跳出来俯瞰项目 细节：记录坑 [印象笔记]+总结整理[博客] 面试前 项目背景 按项目生命周期切分各个环节，需要想清楚： What How（#项目细节 Association Difficulty&amp;Solve Pre-&amp;Post-（#论环环相扣的重要性 …… 客观成就&amp;主观收获（cue其他相关经历 面试中一个可能不错的 Storyline 概述（项目+背景+投入时间+团队成员+担当职能） 过程讲述（突出重点与细节） 总结 part1：遇到的困难+解决思路：[1、2、3… 总结 part2：做的好+不好的地方（紧跟着 之后做了什么弥补&amp;如何改进的思考） 总结 part3：收获与意义 1+2 与 3+4+5 的时间对半分就比较ok~ 一个栗子这是我简历中 [实践经历] 的一段： 未来信号空间站”线上商业研究实践训练营 - 高校研究员 腾讯互娱市场与用户研究部 2018年10月 - 2019年10月 在腾讯互娱用户研究经理的指导下连续两期从事长达12个月的泛文娱领域前沿商业研究，合作互动叙事剧本评测、游戏 IP 运营方法论等8 个深度课题，累计独立撰写超过40个文娱领域前沿趋势小报告约六万字，个人排名连续上升后稳定在20%，二期六个月总排名3/51。 在面试前准备的时候可能会就与岗位匹配的1-2个小型课题及相关趋势小报告重点准备~ 那在面试中当问到“你能不能介绍一下这段经历？”的时候，就可以这样表述： 它是腾讯互娱市场与用户研究部与玖久咨询一起办的一个高校学生参与的线上实践活动，每期六个月，我是从18年10月到19年10月连续参加了两期。每周都会独立撰写趋势洞察报告，比如去年的互动剧风口，还有观察类真人秀，包括我个人可能比较擅长去从一些游戏的玩法或玩家群体切入去进行分析。那除了独立撰写报告的部分之外就是小组合作的课题了，大家都是线上远程合作去完成一些文娱方向的课题，像xxxx、xxx等。 那在撰写趋势洞察报告的时候，其实会花很长时间去从各种渠道获取有价值的信息，然后提炼观点；主要从趋势背后的变化、变化可能带来的影响，以及如何在业务上利用趋势去论述。那在小型课题的研究方面主要是确定研究框架然后分工合作完成。 遇到的困难：很多的瓶颈期，五十几周到最后感觉自己写的东西没有什么新意；a.保持对信息渠道的遍历，写不出来也要多看、b.和朋友交流、c.多推敲多问自己“为什么”etc. 最大的收获：a. 策划视角朝研究视角的转变，对未来职业的思考；b. 很多新传专业的同学，跳出学校视角对专业的理解；c. 洞察力/笔力/分析能力（框架先行）","link":"/2019/11/18/%E9%A1%B9%E7%9B%AE%E7%BB%8F%E5%8E%86%E5%9B%9E%E7%AD%94%E6%80%9D%E8%B7%AF/"},{"title":"1118-1124《数据的真相：如何在数据时代做出明智决策》+《游戏情感设计：如何触动玩家的心灵》+《游戏情感设计：如何触动玩家的心灵》","text":"这周看的三本书w 数据的真相：如何在数据时代做出明智决策 你必须时常问自己，是否能够准确地将研究发现从样本推广到数据总体？这种推广的可能性称作外延有效性，即把从样品中得出的结论加以推广，从而得出对整个数据总体有意义的结论。 如果缺失的地基位于错误的位置——或缺失太多地基，那整座房子将会倒塌。 有些故事之所以能够成为新闻，只因其报道的是离群值。老生常谈和那些非比寻常的事相比，常常会显得没有那么激动人心。 在一个良好的统计模型中，应该能够任意排除一个数据，统计结果不会因之发生显著变化。 关联性和因果性不同，这其实是人们解读数据时最常见的错误之一。 遗漏变量是造成关联性和因果性不同的主要原因。 只需牢记一句话，尽管你所运用的是能够掌握的最佳数据，但想要证明因果关系依然是一场硬仗。 虚假关联很有用，因为可以凸显出遗漏变量的存在，并描绘出将关联等同于因果会导致的潜在危险。 在你日常生活中看待互为关联的事物时应牢记于心。自我提问：两者的关联性纯粹只是巧合？还是由遗漏变量在起作用？ 统计学并非总是完美的，但它提供了一个维度，让人可以用科学的方式评估数据。 弗里德曼《最佳工作场所：创造一个非凡的工作场所所需要的艺术与科学》：“我们的大脑通过进化，变得擅于寻找秩序、预测事情发展。我们无法控制这个过程——我们就会处处寻找联系，即使联系并不存在” 实证性偏见几乎影响着你对待数据的方方面面——从抽样到观察到预测——因此在解读数据的时候，你必须时时留心。在研究关联性和因果性的时候，实证性偏见是有些人忽略遗漏变量的一大原因 因为他们凭借先入为主的观念，而且基于真实的数据，把两件事时间的关联性当成了因果性。 置信区间和置信水平在科学论文与科学研究中应用广泛，而在针对科学论文和研究的媒体报道中所见甚少。这存在问题，因为一旦离开了置信区间和置信水平，就无法知道事情的全部真相。 显著性差异并不能支配一切。哪怕已经的处理显著性差异，依然需要留心我们在本书中提到的其他因素（遗漏变量、离群值等），除此之外还有其他的一系列偏差（证实偏差、选择偏差等） 下面有5件你可以立即着手去做的事，以此了解自己所看到的数据是否真的都有用。 确定所看到的结果是否随机出现要了解，许多研究发现其实是基于或然性的。 很多情况下我们会得出可以确信的结论，但要记住，我们只是在衡量或然性而已。 要知道，你在新闻标题中看到的数据常常是范围中的一个值。 哪怕得出了显著性差异的效应，也要看一下效应量。思考数据对你生活产生的影响。 不要赋予任何数据超出其自身的意义。他看似很有说服力，但未必能准确地呈现出事情的全貌。 伊利诺伊大学教授、商学院商业与公共政策中心主任杰弗里布朗，他说：“正确看待预测的方式是将其看做一种缩小出现不同结果可能性的手段”，即缩小‘任何事情都可能会发生’与‘这就是可能会发生的结果’二者间范围。实证性偏见（confirmation bias）用巩固自己预期的方式解释数据的倾向外延有效性（external validity）把从样品中得出的结论加以推广，从而得出对整个数据总体有意义的结论。 游戏情感设计：如何触动玩家的心灵第一章 一系列有趣的选择：情感设计的构建模块 我们对公益游戏（为公益事业而设计的游戏）赋予了过高的期望——和很多非盈利组织、健康机构及社会性企业一样，我们没有意识到糟糕的游戏设计连最基本的效果都达不到。为了实现学习、训练或者健康等设计目的，我们很有可能做出糟糕的、无聊的、=没有吸引力的游戏。 游戏和其他媒介最基本的区别是：它们为玩家们提供了通过自己的努力来影响结果的机会。能够影响结果的操作——有趣的选择——给了游戏设计师们创造一系列新的情感体验的可能性。归根结底，这些可能性之所以存在是因为在日常生活中，我们的情感是和我们的目标、选择及选择的结果密切相关的，在游戏中也一样。当面临很多选择时，人们会经历一个快速和自动化的评估过程，来评估每件事情对他们的目标和计划会产生怎么样的影响。在这个评估过程中，情感会被激发，以引导做出快速、适当的行为。 一些观影者或读者在经过了一段时间后确实会对角色产生强烈的情感依附，这些现象会称为拟社会现象。 （游戏）它允许我们去经历另一种人生，同时也组成了我们自己人生经历的一部分。 经过长时间的游戏，玩家们会把自己的动机与本能、认知、社交和幻想四个层面的可能性渐渐融入到游戏角色上，基于观察、行为和体验，获得一种身份上的认同。和其他媒体中的角色相比，玩家会更深地投入到游戏角色中，因为游戏角色能在多重心理层面上提供行为的可能性。 《模拟人生》系列游戏顽皮的人物角色设计让游戏变得格外吸引人。拿些没有异议的喃喃碎语，简化的卡通形象和对话，其实会比高度细化的精致的对白、界面和美术风格留给玩家更多想象的空间。一个抽象的、程序化的角色表现形式更容易让观看者将自己投射到角色身上，而不会因为角色身上特殊的人物品质和怪癖而分心。 游戏设计师们使用这些方法不只是娱乐，同时也为了唤起更深的意识觉醒， 与他人相处的责任感与复杂性。 游戏角色和NPC们也允许并鼓励我们和他们建立一种深刻而有意义的虚拟关系 第二章 社交游戏：多人玩家情感的设计 研究人员试着通过问卷调查进和生理指标的测量（皮肤电反应 GSR 和肌电图肌肉活动测量法 EMG）来鉴别每种情况下玩家反映的不同。 问卷调研：测量玩家的主观认知和偏好生理指标测量：也许会和玩家的主观报告有所区别 游戏设计师们在社交游戏中用来唤起玩家丰富情感反馈的三种构建模块：协调行动、角色扮演和社交场合。 游戏设计师们设置特定的社交场景，目的是触发某些特定的行为和冲动，从而创造出他们希望玩家们能共同体验到的情感和社交反馈。因为他揭示了一种强大的玩家合作文化，即使面对的是新的规则、竞争元素和奖励系统。 第三章 游戏中的肢体动作：运用动作设计来创造情感和联系 游戏设计师们运用运动来塑造情感和社会联系的三种方法——设置身体挑战来引发情感反应，运用运动来促进有趣的社交动态，以及使用身体作为一种工具来把玩家幻想的身份带到身份中。 设计师们意识到删除玩家视频，用一个自信、流畅的游戏角色代替屏幕上的玩家是更好的方案。 那些把玩家们的身体调整到新的、意想不到的身体结构的运动能够触发强烈的社交和情感体验。 通过运动来唤起情感并驱动有趣的社交关系和体验的效率就越高。本章提到的独立游戏使用了声音、触觉反馈和人力支持（类似MC主持人这样的角色）来打破玩家对屏幕的紧密的视觉依赖。 我们已经看到了掌握一项新的身体机能时所产生的强大情感力量，也看到了与其他人一起运动时候所产生的社交与情感力量。基于身体设计游戏的第三个方面，就是让玩家利用自己的身体来培养假想身份，使情绪在一定范围内转变成为可能。 电子游戏设计师们现在可以把玩家身体本身当做一种媒介来塑造情感和建立社交连接。 第四章 消除隔阂，创造亲密感和联系 设计师使用的三个策略：数字道具的分享与交流，夏令营式的游戏环境的培养，以及围绕游戏建立业余玩家与专业玩家的社区。 魔法圈是在20世纪30年代由荷兰历史学家和文化理论家 Johan Huizinga 创造的一个术语——一个安全、有界的环境，玩家在其中可以将奇幻与真实结合在一起，并因此使得更自由更自如的社会联系和情感表达更容易发生。 玩家和学者已经撰写了许多关于长期在虚拟世界中进行游戏而形成的强大社交和情感纽带的文章。但很少有人探索另一种网络游戏中的社区建设能力，那就是异步大规模游戏（玩家在不同时间参与同一种游戏） 算法霸权：数学杀伤性武器的威胁第一章 盲点炸弹：不透明、规模化和毁灭性 棒球模型基本上是一种健康模型。这种模型信息透明，不断更新。棒球模型仰赖比赛进行过程中积累的真实数据，而不是替代性的间接变量。家庭饮食模型，良性模型，假设清晰。但很难规模化。再犯模型绝非个例。不透明、隐形成了这些模型的规则，清晰、透明的模型倒成了例外。即使这些模型是良性模型，不透明还是给人一种不公平的感觉。 对一部分人不公平的关键原因是模型造成的恶性循环。它会自行创建一种使假设合理化的环境。而模型则在此恶性循环的过程中变得越来越不公平。 数字杀伤性武器共有三个特征：不透明、规模化、毁灭性。这些数学杀伤性武器关闭了亿万人的忌讳之门，通常只是因为一个微不足道的理由，而且不予他们上诉的机会。因此它们仍然是不公平的模型。 第二章 操纵与恐吓：弹震症患者的醒悟 我越来越担心技术模型与现实世界中的有血有肉的个体的相互分离的趋势，以及这种分离带来的道德影响。事实上，我在数据、科学领域看到了我在金融领域见到过的同样的模式：一种盲目的安全感导致的不完善模型的广泛应用，模型对于评估效果的自我定义，以及加速恶化的反馈循环。而与此同时，模型的反对者被认为是落后的科技恐慌分子。 第三章 恶意循环：排名模型的特权与焦虑 其中大量的评估因素仅仅来自直觉，模型确立的过程并不眼睛，统计分析也缺少根据。在大学排名这个案例中，模型建立的一句仅仅是人们凭空想象什么是对教育而言最重要的因素。然后这些人便去寻找可以测量的相关变量，最后随意地在公式中赋予每个变量一定的权重。 在大部分领域中，模型确立的过程通常还是比较严谨的。如农业学科的研究者会比较投入（土壤、阳光和化肥）和产出（收获后，具有特定特征的农作物的产量。）然后他们就可以按照他们的目标，比如一定的成本、口感或者应将价值等进行下一步的实验和优化。但这并不是说农学家就不可能建立数学杀伤性武器。他们也曾经建立过数学杀伤性武器（尤其是当他们没有考虑到杀虫剂长期而广泛的影响时）。但是，因为他们的模型在大多数情况下关注的是一个明确的结果，所以我们依然认为这是一个相对理想的科学实验过程。 当你基于替代变量建立模型时，钻模型的漏洞会变得容易很多。这是因为替代变量比起其所代表的的复杂事实更容易操控。 每一个排名模型都有漏洞可钻，而一旦被钻了空子，模型就会产生新一轮恶心循环以及大量意料之外的有害后果。 第四章 数据经济：掠夺式广告的赢家 互联网基于我们的网上行为所透露出来的内在偏好和萱蕚模式，把我们放在数百种模型中进行排名、分类以及评分。这为合法的广告营销奠定的了强大的基础，但同时也助长了掠夺式广告的兴趣，后者指精确找出有迫切需求的群体，并向他们兜售虚假承诺的广告。掠夺式广告以寻找不平等并大肆利用不平等为己任，其结果是进一步巩固了现有的社会分层。整个社会最大的分水岭就出现在这个系统的赢家（比如风险投资人）和赢家所建立的模型的掠夺目标之间。 在人民既有迫切需求又对具体信息很无知的任何地方，你都能看到掠夺式广告。它们大规模聚集于社会中最绝望的那群人。在教育方面，它们承诺通向成功的道路，但这条路的重点往往是贫穷的深渊。受害者们几乎无从了解他们是如何被选中的，或者广告商是如何能够对他们有那么详尽了解的。 第五章 效率权衡与逻辑漏洞：大数据时代的正义第六章 筛选：颅相学的偏见强化更糟糕的是，一旦模型经过了技术专家的校准投入使用，此后模型收到的可用于修正的反馈数据就变的极少。 第七章 反馈：辛普森悖论的噪声 一如许多其他的数学杀伤性武器，问题的根源在于模型创建者选择了什么目标。这些模型追求的是效率和盈利的最大化，而不是正义或“团队”的福祉。 大量的数学杀伤性武器，只不过是在打造它们自己所定义行家本应在试图弄清楚一的现实。 辛普森悖论：在某个条件下，两组数据在讨论时都满足了某种性质，可是一旦合并考虑，就可能导致相同的结论。 第八章 替代变量和间接损害：信用数据的陷阱 所有这些数据点都是替代变量。这位银位客户的支付能力的过程审中冷静地研究这些数据（一些传统的银行家一定会如此）。但是与之相反，这位银行家草率地把这些数据与种族、宗教和家庭关系联系在一起。此举避免了查借款人的个人情况的麻烦，而把借款人归入到一个群体之中，今天的统计学家称之为“池”。然后，这位银行家会决定“像你这样的那类人”能不能被信任。 随着电子评分甚嚣尘上，我们被一些秘密算法归类分组，其中有些算法仰赖的还是错误百出的个人档案。我们不是被当做个体，而是被当做某个群体的一员，被迫戴上了某顶帽子。 第九章 “一般人”共识：沉溺与歧视 模型在我们看不到的地方仍然把我们归类为各种各样的群体，以各种行为模式为指标。不管最终的分析正确与否，这种不透明性都会导致欺诈。 这些自动化程序将日益决定着我们会如何被其他系统对待，后者将决定我们看到的广告、为我们设定商品的价格。这些系统运作高校，表面上看只是给出了随机的建议，同时完全不给出任何解释。没有人能够理解这些系统的内在逻辑或者解释我们收到的这些信息的原因。如果我们不夺回一定程度的控制权，这些未来的数学杀伤性武器将会成为隐藏在人类社会幕后的控制者。它们将以它们的方式对待我们，而我们却对此毫不知情。 第十章 正面的力量： 微目标的出发点 然而超市模型与选民模型之间有一个关键的不同。在超市模型中，所有可用数据都与购物密切相关。他们通过研究人们的购物模式，来预测（和影响）人们的购物行为。但在政治选取方面，密切相关的可用数据则少之又少。要建立这个模型，数据团队需要找到替代变量，可这需要建立在深入调查的基础上。 这种通过挖掘数据建立个人档案预测个人行为的为目标锁定技术经不断发展，已完全符合我们所说的数学杀伤性武器的所有特征。这种技术影响范围广，不透明，且不负责任。在该技术的掩护下，政客们得以更顺利地在不同人面前展示自己。 结论我们如何规范这些逐渐渗透继而操纵着我们整个生活的数学模型呢？我建议从建模者自己开始做起。数据科学家应该像医生一样遵守希波克拉底誓言，尽可能放置或避免对模型可能的误用和误解。2008年经济危机爆发之后，伊曼纽尔德曼和保罗威尔莫特两名金融工程师起草了这个誓言。内容如下： 我将牢记我并未创造世界，也不会让世界来满足我的方程式；虽然我将大胆使用模型来估算价值，但不会过分倚重这一数学分析；我将永远不会为了追求模型的间接而牺牲现实的复杂，除非我能够对我这样做的原因给出一个合理的解释；我也不会向使用我所创建的模型的人们夸大模型的精确性。相反，我将明确说明模型中的假设条件与模型忽略的因素；我明白我的工作可能会对社会和经济造成巨大影响，其中的许多影响将超出我的认知范畴。 这是我们的数学杀伤性武器消除行动的一个很好的哲学基础。但坚定的价值观和自我约束只对谨慎的人有效。更重要的是，这一改变后的希波克拉底誓言忽略了数据科学家在寻求他们的牢门所需求的具体答案时的实际压力。要想消灭数学杀伤性武器，我们不仅仅要在数据行业确立最佳反例，还要推行相关的法律条例，要想实现这一目标，我们必须重新评估模型的成功标准。 针对数学杀伤性武器建立的监管系统必须衡量这些潜在成本，同时还要体现更多的非数值价值。","link":"/2019/11/24/1118-1124%E3%80%8A%E6%95%B0%E6%8D%AE%E7%9A%84%E7%9C%9F%E7%9B%B8%EF%BC%9A%E5%A6%82%E4%BD%95%E5%9C%A8%E6%95%B0%E6%8D%AE%E6%97%B6%E4%BB%A3%E5%81%9A%E5%87%BA%E6%98%8E%E6%99%BA%E5%86%B3%E7%AD%96%E3%80%8B+%E3%80%8A%E6%B8%B8%E6%88%8F%E6%83%85%E6%84%9F%E8%AE%BE%E8%AE%A1%EF%BC%9A%E5%A6%82%E4%BD%95%E8%A7%A6%E5%8A%A8%E7%8E%A9%E5%AE%B6%E7%9A%84%E5%BF%83%E7%81%B5%E3%80%8B+%E3%80%8A%E6%B8%B8%E6%88%8F%E6%83%85%E6%84%9F%E8%AE%BE%E8%AE%A1%EF%BC%9A%E5%A6%82%E4%BD%95%E8%A7%A6%E5%8A%A8%E7%8E%A9%E5%AE%B6%E7%9A%84%E5%BF%83%E7%81%B5%E3%80%8B/"}],"tags":[{"name":"2019年秋季","slug":"2019年秋季","link":"/tags/2019%E5%B9%B4%E7%A7%8B%E5%AD%A3/"},{"name":"坑不能白踩系列","slug":"坑不能白踩系列","link":"/tags/%E5%9D%91%E4%B8%8D%E8%83%BD%E7%99%BD%E8%B8%A9%E7%B3%BB%E5%88%97/"},{"name":"数据科学","slug":"数据科学","link":"/tags/%E6%95%B0%E6%8D%AE%E7%A7%91%E5%AD%A6/"},{"name":"游戏设计","slug":"游戏设计","link":"/tags/%E6%B8%B8%E6%88%8F%E8%AE%BE%E8%AE%A1/"}],"categories":[{"name":"面试","slug":"面试","link":"/categories/%E9%9D%A2%E8%AF%95/"},{"name":"多读书","slug":"多读书","link":"/categories/%E5%A4%9A%E8%AF%BB%E4%B9%A6/"}]}